manual-test/arguments/ChangePasswordArguments.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <ns1:ChangePasswordArguments
                xmlns:ns1="http://uws.provider.com/"
                xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                xsi:type="ns1:ChangePasswordArguments">
            <newPassword>newpass</newPassword>
            <password>pwd</password>
            <username>user</username>
        </ns1:ChangePasswordArguments>
    </soapenv:Body>
</soapenv:Envelope>