manual-test/arguments/PerformTransactionArguments.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <ns1:PerformTransactionArguments
                xmlns:ns1="http://uws.provider.com/"
                xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                xsi:type="ns1:PerformTransactionArguments">
            <password>123</password>
            <username>pablo_escobar</username>
            <amount>10000</amount>
            <parameters>
                <paramKey>phone</paramKey>
                <paramValue>+7(903)888-88-88</paramValue>
            </parameters>
            <parameters>
                <paramKey>card_number</paramKey>
                <paramValue>4111 1111 1111 1111</paramValue>
            </parameters>
            <parameters>
                <paramKey>customer_id</paramKey>
                <paramValue>2</paramValue>
            </parameters>
            <parameters>
                <paramKey>pin</paramKey>
                <paramValue>12345678</paramValue>
            </parameters>
            <serviceId>1</serviceId>
            <transactionId>1</transactionId>
            <transactionTime>2011-04-26T18:07:22</transactionTime>
        </ns1:PerformTransactionArguments>
    </soapenv:Body>
</soapenv:Envelope>